spec/vcr/Customer/should_list_charges_to_a_customer_given_a_token.yml

---
http_interactions:
- request:
    method: get
    uri: https://<key>:@test-api.pin.net.au/1/customers/cus_8ImkZdEZ6BXUA6NcJDZg_g/charges
    body:
      encoding: US-ASCII
      string: ''
    headers: {}
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - must-revalidate, private, max-age=0
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Thu, 04 Jul 2013 16:28:45 GMT
      Etag:
      - '"118eff05b63d8c09969161610d12d39a"'
      Server:
      - Apache/2.2.20 (Ubuntu)
      Status:
      - '200'
      Strict-Transport-Security:
      - max-age=31536000
      Vary:
      - User-Agent
      X-Powered-By:
      - Phusion Passenger (mod_rails/mod_rack) 3.0.11
      X-Rack-Cache:
      - miss
      X-Request-Id:
      - 93e6f348b9c42eafdac7b7d7a171b724
      X-Runtime:
      - '0.085315'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Content-Length:
      - '783'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"response":[{"token":"ch_0kdOMXP7gG0_W_Vh8qAWdA","success":true,"amount":190000,"currency":"AUD","description":"mid
        Plan - My Focusbook","email":"hello@myfocusbook.com.au","ip_address":"24.84.102.169","created_at":"2013-03-23T01:30:30Z","status_message":"An
        unexpected error has occurred","error_message":null,"card":{"token":"card_h5nBfXPhwVJH5W0jqwl-pQ","display_number":"XXXX-XXXX-XXXX-0000","scheme":"master","address_line1":"33
        Lyon Street","address_line2":"","address_city":"Melbourne","address_postcode":"3040","address_state":"Victoria","address_country":"Australia"},"transfer":[],"amount_refunded":0,"total_fees":5730,"merchant_entitlement":184270,"refund_pending":false}],"count":1,"pagination":{"current":1,"previous":null,"next":null,"per_page":25,"pages":1,"count":1}}'
    http_version: 
  recorded_at: Thu, 04 Jul 2013 16:28:48 GMT
recorded_with: VCR 2.5.0
